<?php
/*
Напишите скрипт, который считывает название файлов из папки и, если эти названия на русском, меняет их на транслит.
*/
// Папка с файлами
$dir = "C:\Users\gavri\Downloads";

// Функция для транслитерации строки
function transliterateFilesInDir($dir) {
  $tr = array(
    "А" => "A", "Б" => "B", "В" => "V", "Г" => "G", "Д" => "D", "Е" => "E", "Ё" => "E",
        "Ж" => "Zh", "З" => "Z", "И" => "I", "Й" => "Y", "К" => "K", "Л" => "L", "М" => "M",
        "Н" => "N", "О" => "O", "П" => "P", "Р" => "R", "С" => "S", "Т" => "T", "У" => "U",
        "Ф" => "F", "Х" => "Kh", "Ц" => "Ts", "Ч" => "Ch", "Ш" => "Sh", "Щ" => "Shch",
        "Ы" => "Y", "Э" => "E", "Ю" => "Yu", "Я" => "Ya",
        "а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "e",
        "ж" => "zh", "з" => "z", "и" => "i", "й" => "y", "к" => "k", "л" => "l", "м" => "m",
        "н" => "n", "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t", "у" => "u",
        "ф" => "f", "х" => "kh", "ц" => "ts", "ч" => "ch", "ш" => "sh", "щ" => "shch",
        "ы" => "y", "э" => "e", "ю" => "yu", "я" => "ya",
  );

  // Получаем список файлов
$files = scandir($dir);

// Проходимся по каждому файлу
foreach ($files as $file) {
  // Пропускаем точки и родительские каталоги
  if($file === '.' || $file === '..') {
    continue;
  }

  // Получаем имя файла без расширения
  $filename = pathinfo($file, PATHINFO_FILENAME);

  // Проверяем, является ли имя файла кириллицей
  if(preg_match('/[а-яА-я]/u', $filename)) {
    // Транслитерируем имя файла
    $new_filename = strtr($filename, $tr);
    // Меняем имя файла
    rename($dir . '/' . $file, $dir . '/' . $new_filename . '.' . pathinfo($file, PATHINFO_EXTENSION));

    echo "Переименован файл: $file -> $new_filename." .  pathinfo($file, PATHINFO_EXTENSION) . "<br>";
  }
}
echo "Все файлы переименованы.";
}

transliterateFilesInDir($dir);





